test.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.bulkSms.ws/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:checkBalance>
         <!--Optional:-->
         <User>sapling</User>
         <!--Optional:-->
         <Password>14ab78@#c9</Password>
         <!--Optional:-->
         <CPCode>SAPLING</CPCode>
         <!--Optional:-->
         <RequestID>4</RequestID>
         <!--Optional:-->
         <ServiceID>THPT-LTV</ServiceID>
      </impl:checkBalance>
   </soapenv:Body>
</soapenv:Envelope>
